system/controlDict
FoamFile
{
	class	dictionary;
	format	ascii;
	location	system;
	object	controlDict;
	version	2.0;
}
adjustTimeStep	false;
application	pimpleFoam;
deltaT	1;
endTime	1000;
maxCo	2;
maxDeltaT	1;
purgeWrite	2;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
timeFormat	general;
timePrecision	6;
writeControl	adjustableRunTime;
writeInterval	1;
writePrecision	7;
runTimeModifiable	true;
compression	uncompressed;
timeFormat	general;
timePrecision	6;
writeFormat	binary;
writePrecision	7;
libs	("libfvMotionSolvers.so" "libturbulenceModels.so" "libturbulenceModelSchemes.so");
functions
{
	forceMonitorOnCoral_genInDefault
	{
		U	U;
		libs	("libforces.so");
		p	p;
		rho	rhoInf;
		type	forces;
		CofR	(0 0 0);
		coefficients	(Cd Cl CmPitch);
		patches	(coral_gen);
		rhoInf	1.0;
		executeInterval	1;
		enabled	true;
		log	true;
		writeInterval	1;
	}
}
OptimisationSwitches
{
	fileHandler	uncollated;
	fileModificationSkew	0;
	maxMasterFileBufferSize	1.0E9;
	maxThreadFileBufferSize	1.0E9;
	mpiBufferSize	200000000;
}
