system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-1.01 -1.01 -1.01)
	(1.01 -1.01 -1.01)
	(1.01 1.01 -1.01)
	(-1.01 1.01 -1.01)
	(-1.01 -1.01 1.01)
	(1.01 -1.01 1.01)
	(1.01 1.01 1.01)
	(-1.01 1.01 1.01)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (5 5 5) simpleGrading (1 1 1)
);
edges	();
boundary	(
	top
	{
		type	patch;
		faces	(
			(3 7 6 2)
		);
	}
	bottom
	{
		type	patch;
		faces	(
			(1 5 4 0)
		);
	}
	symmetry
	{
		type	patch;
		faces	(
			(0 3 2 1)
		);
	}
	right
	{
		type	patch;
		faces	(
			(4 5 6 7)
		);
	}
	outlet
	{
		type	patch;
		faces	(
			(2 6 5 1)
		);
	}
	inlet
	{
		type	patch;
		faces	(
			(0 4 7 3)
		);
	}
);
