system/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSolution;
}
solvers
{
	p
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	1.0E-4;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
	}
	pFinal
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	1.0E-4;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
		minIter	1;
	}
	U
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	UFinal
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
		minIter	1;
	}
}
PIMPLE
{
	consistent	true;
	nCorrectors	1;
	nNonOrthogonalCorrectors	1;
	momentumPredictor	true;
	moveMeshOuterCorrectors	false;
	correctPhi	false;
	checkMeshCourantNo	false;
	nOuterCorrectors	1;
	residualControl
	{
		p
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		U
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
	}
	pRefCell	0;
	pRefValue	0.0;
}
relaxationFactors
{
	p	1.0;
	U	1.0;
}
