system/foamDataToFluentDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	foamDataToFluentDict;
}
p	1;
p_rgh	1;
U	2;
Urel	2;
T	3;
h	4;
k	5;
epsilon	6;
omega	63;
